
void jiwon(float x, float y, float r){  //최지원
  stroke(0);
  fill(0,150,255);
  circle(x,y, 2*r); //전체얼굴,파란색
  
  fill(255,255,255);
  ellipse(x,y+(r/5),(3* (r/2)),(8* (r/5))); // 얼굴 무늬,흰색
  
  fill(255,255,255);
  ellipse(x-(r/5),y-(r/2),(2*r/5),(3* (r/5))); // 왼쪽눈,흰색
  ellipse(x+(r/5),y-(r/2),(2*r/5),(3* (r/5))); // 오른눈,흰색
  fill(0,0,0);
  ellipse(x-(6* (r/50)),y-(23* (r/50)),(1* (r/5)),(2* (r/5))); // 왼쪽큰눈동자,검은색
  ellipse(x+(6* (r/50)),y-(23* (r/50)),(1* (r/5)),(2* (r/5))); // 오른쪽눈동자,검은색
  
  fill(255,255,255);
  ellipse(x+(5* (r/50)),y-(22* (r/50)),(3* (r/50)),(8* (r/50))); // 오른쪽 작은눈동자, 흰색
  ellipse(x-(5* (r/50)),y-(22* (r/50)),(3* (r/50)),(8* (r/50))); // 왼 작은눈동자, 흰색
  
  fill(255,0,0);
  circle(x,y-(10* (r/50)),(10* (r/50))); // 코,빨간색
  
  fill(255,255,255);
  arc(x,y+(7* (r/50)),(70* (r/50)),(70* (r/50)),0,PI); // 입
  
  line(x,y-(5* (r/50)),x,y+(40* (r/50))); // 코 밑 라인
  
  line(x-20* (r/50),y-10* (r/50),x-45* (r/50),y-20* (r/50)); // 왼쪽 수염 1
  line(x-20* (r/50),y,x-50* (r/50),y); // 왼쪽 수염 2
  line(x-20* (r/50),y+10* (r/50),x-45* (r/50),y+20* (r/50)); // 왼쪽 수염 3
  
  line(x+20* (r/50),y-10* (r/50),x+45* (r/50),y-20* (r/50)); // 오른쪽 수염 1
  line(x+20* (r/50),y,x+50* (r/50),y); // 오른쪽 수염 2
  line(x+20* (r/50),y+10* (r/50),x+45* (r/50),y+20* (r/50)); // 오른쪽 수염 3
  
}
